In [1]:
import pandas as pd
import numpy as np

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [6]:
data = {
    "도시": ["서울", "서울", "부산", "의정부", "대구", "인천", "부산", "부산"],
    "연도": ["2015", "2013", "2009", "2018", "2015", "2015", "2013", "2015",],
    "인구": [9595, 11110, 5525, 2626, 4545, 6523, 6532, 5002],
    "지역": ["수도권", "수도권", "경상권", "수도권", "경상권", "수도권", "경상권","경상권"]
}

columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

    도시    연도     인구   지역
0   서울  2015   9595  수도권
1   서울  2013  11110  수도권
2   부산  2009   5525  경상권
3  의정부  2018   2626  수도권
4   대구  2015   4545  경상권
5   인천  2015   6523  수도권
6   부산  2013   6532  경상권
7   부산  2015   5002  경상권

In [9]:
data = {
    "도시": ["서울", "서울", "부산", "의정부", "대구", "인천", "부산", "부산"],
    "연도": ["2015", "2013", "2009", "2018", "2015", "2015", "2013", "2015",],
    "인구": [9595, 11110, 5525, 2626, 4545, 6523, 6532, 5002],
    "지역": ["수도권", "수도권", "경상권", "수도권", "경상권", "수도권", "경상권","경상권"]
}
index = np.arange(1,9)
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, index=index, columns=columns) #인덱스,컬럼 값 설정
df1

    도시    연도     인구   지역
1   서울  2015   9595  수도권
2   서울  2013  11110  수도권
3   부산  2009   5525  경상권
4  의정부  2018   2626  수도권
5   대구  2015   4545  경상권
6   인천  2015   6523  수도권
7   부산  2013   6532  경상권
8   부산  2015   5002  경상권

In [11]:
### 피봇 테이블 작성 시 반드시 설정해야하는 인수 
# data : 사용 데이터 프레임
# index: 행 인덱스로 사용할 필드(기준 필드로 작용됨)
# 인덱스 명을 제외한 나머지 값(data)은 수치 data만 사용
# 기본 함수가 평균함수이기때문에 각 데이터 평균값이 반환

In [12]:
df1.pivot_table(index=["지역","도시"],columns="연도", values="인구")

연도         2009     2013    2015    2018
지역  도시
경상권 대구      NaN      NaN  4545.0     NaN
    부산   5525.0   6532.0  5002.0     NaN
수도권 서울      NaN  11110.0  9595.0     NaN
    의정부     NaN      NaN     NaN  2626.0
    인천      NaN      NaN  6523.0     NaN

In [13]:
df1.pivot_table(index=["지역"],columns=["연도","도시"], values="인구")

연도     2009    2013             2015                            2018
도시       부산      부산       서울      대구      부산      서울      인천     의정부
지역
경상권  5525.0  6532.0      NaN  4545.0  5002.0     NaN     NaN     NaN
수도권     NaN     NaN  11110.0     NaN     NaN  9595.0  6523.0  2626.0

In [14]:
import seaborn as sns

In [15]:
df = sns.load_dataset('titanic')[['age','sex','class','survived']]
df.head()

    age     sex  class  survived
0  22.0    male  Third         0
1  38.0  female  First         1
2  26.0  female  Third         1
3  35.0  female  First         1
4  35.0    male  Third         0

In [16]:
pdf1 = pd.pivot_table(df,
                     index='class',
                     columns='sex',
                    values='age',
                      aggfunc='mean'
                    )
pdf1

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

In [19]:
pdf1 = pd.pivot_table(df, index='class', columns='sex', values='survived',aggfunc=['mean','sum'])
pdf1

            mean              sum
sex       female      male female male
class
First   0.968085  0.368852     91   45
Second  0.921053  0.157407     70   17
Third   0.500000  0.135447     72   47

In [20]:
pdf1 = pd.pivot_table(df,
                     index=['class','sex'],
                     columns='survived',
                    values='age',
                      aggfunc=['mean','max']
                    )
pdf1

                    mean              max
survived               0          1     0     1
class  sex
First  female  25.666667  34.939024  50.0  63.0
       male    44.581967  36.248000  71.0  80.0
Second female  36.000000  28.080882  57.0  55.0
       male    33.369048  16.022000  70.0  62.0
Third  female  23.818182  19.329787  48.0  63.0
       male    27.255814  22.274211  74.0  45.0